
## :x: Apply Failed

[CI link](https://github.com/goda6565/portfolio/actions/runs/15137539927)



It failed to parse the result.

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.cloudrun_service.google_cloud_run_v2_service.cloudrun_service will be created
  + resource "google_cloud_run_v2_service" "cloudrun_service" {
      + conditions              = (known after apply)
      + create_time             = (known after apply)
      + creator                 = (known after apply)
      + delete_time             = (known after apply)
      + deletion_protection     = false
      + effective_annotations   = (known after apply)
      + effective_labels        = {
          + "goog-terraform-provisioned" = "true"
        }
      + etag                    = (known after apply)
      + expire_time             = (known after apply)
      + generation              = (known after apply)
      + id                      = (known after apply)
      + ingress                 = "INGRESS_TRAFFIC_ALL"
      + last_modifier           = (known after apply)
      + latest_created_revision = (known after apply)
      + latest_ready_revision   = (known after apply)
      + launch_stage            = (known after apply)
      + location                = "asia-northeast1"
      + name                    = "frontend-main"
      + observed_generation     = (known after apply)
      + project                 = "portfolio-460206"
      + reconciling             = (known after apply)
      + terminal_condition      = (known after apply)
      + terraform_labels        = {
          + "goog-terraform-provisioned" = "true"
        }
      + traffic_statuses        = (known after apply)
      + uid                     = (known after apply)
      + update_time             = (known after apply)
      + uri                     = (known after apply)
      + urls                    = (known after apply)

      + template {
          + max_instance_request_concurrency = (known after apply)
          + service_account                  = (known after apply)
          + timeout                          = (known after apply)

          + containers {
              + build_info = (known after apply)
              + image      = "nginx:latest"

              + ports (known after apply)

              + resources (known after apply)

              + startup_probe (known after apply)
            }

          + scaling (known after apply)
        }

      + traffic (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
module.cloudrun_service.google_cloud_run_v2_service.cloudrun_service: Creating...
module.cloudrun_service.google_cloud_run_v2_service.cloudrun_service: Still creating... [00m10s elapsed]
module.cloudrun_service.google_cloud_run_v2_service.cloudrun_service: Still creating... [00m20s elapsed]
module.cloudrun_service.google_cloud_run_v2_service.cloudrun_service: Still creating... [00m30s elapsed]
module.cloudrun_service.google_cloud_run_v2_service.cloudrun_service: Still creating... [00m40s elapsed]
module.cloudrun_service.google_cloud_run_v2_service.cloudrun_service: Still creating... [00m50s elapsed]
module.cloudrun_service.google_cloud_run_v2_service.cloudrun_service: Still creating... [01m00s elapsed]
module.cloudrun_service.google_cloud_run_v2_service.cloudrun_service: Still creating... [01m10s elapsed]
module.cloudrun_service.google_cloud_run_v2_service.cloudrun_service: Still creating... [01m20s elapsed]
module.cloudrun_service.google_cloud_run_v2_service.cloudrun_service: Still creating... [01m30s elapsed]
module.cloudrun_service.google_cloud_run_v2_service.cloudrun_service: Still creating... [01m40s elapsed]
module.cloudrun_service.google_cloud_run_v2_service.cloudrun_service: Still creating... [01m50s elapsed]
module.cloudrun_service.google_cloud_run_v2_service.cloudrun_service: Still creating... [02m00s elapsed]
module.cloudrun_service.google_cloud_run_v2_service.cloudrun_service: Still creating... [02m10s elapsed]
module.cloudrun_service.google_cloud_run_v2_service.cloudrun_service: Still creating... [02m20s elapsed]
module.cloudrun_service.google_cloud_run_v2_service.cloudrun_service: Still creating... [02m30s elapsed]
module.cloudrun_service.google_cloud_run_v2_service.cloudrun_service: Still creating... [02m40s elapsed]
module.cloudrun_service.google_cloud_run_v2_service.cloudrun_service: Still creating... [02m50s elapsed]
module.cloudrun_service.google_cloud_run_v2_service.cloudrun_service: Still creating... [03m00s elapsed]
module.cloudrun_service.google_cloud_run_v2_service.cloudrun_service: Still creating... [03m10s elapsed]
module.cloudrun_service.google_cloud_run_v2_service.cloudrun_service: Still creating... [03m20s elapsed]
module.cloudrun_service.google_cloud_run_v2_service.cloudrun_service: Still creating... [03m30s elapsed]
module.cloudrun_service.google_cloud_run_v2_service.cloudrun_service: Still creating... [03m40s elapsed]
module.cloudrun_service.google_cloud_run_v2_service.cloudrun_service: Still creating... [03m50s elapsed]
module.cloudrun_service.google_cloud_run_v2_service.cloudrun_service: Still creating... [04m00s elapsed]
module.cloudrun_service.google_cloud_run_v2_service.cloudrun_service: Still creating... [04m10s elapsed]
module.cloudrun_service.google_cloud_run_v2_service.cloudrun_service: Still creating... [04m20s elapsed]
module.cloudrun_service.google_cloud_run_v2_service.cloudrun_service: Still creating... [04m30s elapsed]
module.cloudrun_service.google_cloud_run_v2_service.cloudrun_service: Still creating... [04m40s elapsed]
module.cloudrun_service.google_cloud_run_v2_service.cloudrun_service: Still creating... [04m50s elapsed]
module.cloudrun_service.google_cloud_run_v2_service.cloudrun_service: Still creating... [05m00s elapsed]
module.cloudrun_service.google_cloud_run_v2_service.cloudrun_service: Still creating... [05m10s elapsed]
module.cloudrun_service.google_cloud_run_v2_service.cloudrun_service: Still creating... [05m20s elapsed]
module.cloudrun_service.google_cloud_run_v2_service.cloudrun_service: Still creating... [05m30s elapsed]
╷
│ Error: Error waiting to create Service: Error waiting for Creating Service: Error code 9, message: Revision 'frontend-main-00001-v98' is not ready and cannot serve traffic. The user-provided container failed to start and listen on the port defined provided by the PORT=8080 environment variable within the allocated timeout. This can happen when the container port is misconfigured or if the timeout is too short. The health check timeout can be extended. Logs for this revision might contain more information.
│ 
│ Logs URL: https://console.cloud.google.com/logs/viewer?project=portfolio-460206&resource=cloud_run_revision/service_name/frontend-main/revision_name/frontend-main-00001-v98&advancedFilter=resource.type%3D%22cloud_run_revision%22%0Aresource.labels.service_name%3D%22frontend-main%22%0Aresource.labels.revision_name%3D%22frontend-main-00001-v98%22 
│ For more troubleshooting guidance, see https://cloud.google.com/run/docs/troubleshooting#container-failed-to-start
│ 
│   with module.cloudrun_service.google_cloud_run_v2_service.cloudrun_service,
│   on ../../modules/cloudrun/google_cloud_run_v2_service.tf line 1, in resource "google_cloud_run_v2_service" "cloudrun_service":
│    1: resource "google_cloud_run_v2_service" "cloudrun_service" {
│ 
╵
Releasing state lock. This may take a few moments...
::error::Terraform exited with code 1.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":30,"Program":"tfcmt","SHA1":"5e5f39c37c8ab97a114e5ee982216ca11b505588","Vars":{},"WorkflowName":"Terraform Multi-Env CI"} -->